# Import libraries

In [7]:
import pandas as pd

# Get data

Get train data

In [8]:
raw_train_data = pd.read_csv("./data/train.csv")
print(raw_train_data.shape)
raw_train_data.head()

(891, 12)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Get test data

In [9]:
raw_test_data = pd.read_csv("./data/test.csv")
print(raw_test_data.shape)
raw_test_data.head()

(418, 11)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

# Preprocessing

Check if train set has no null values in Survived column

In [10]:
raw_train_data['Survived'].unique()

array([0, 1])

Merging train and test data into one dataset

In [11]:
test_data_with_survived_column = raw_test_data.copy()
test_data_with_survived_column['Survived'] = None
raw_data = pd.concat([raw_train_data, test_data_with_survived_column])
print(raw_data.shape)

(1309, 12)

### Discover any problems in data

In [12]:
raw_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     891 non-null    object
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1308 non-null   float64
 10  Cabin        295 non-null    object
 11  Embarked     1307 non-null   object
dtypes: float64(2), int64(4), object(6)
memory usage: 132.9+ KB

Above we saw that we have 4 features with null values (ignoring the Survived column, obviously), which are: Age, Fare, Cabin and Embarked.
- Age: is a number with like 20% missing values, and seems easy to impute
- Fare: is a number with only one missing value and seems easy to impute
- Cabin: type object, with 80% missing values, I don't know how to impute
- Embarked: type object, with only 2 missing values, seems ok to impute

### Handle problems in data (null values and non-numeric features)

Handle 1

Handle 2

### Split data to train

# Train the model